"""


[title]: # (Корни)


Метод Ньютона
=============

    x = sqrt(y)
    y = x^2
    f(x) = x^2 - y

    Позволяет найти корень целого числа
    y - число
    x - оценка

    >>> y = 2.0
    >>> x = y
    >>> eps = 1e-5 * x
    >>> while (x - y / x) > eps:
    ...     x = (x + y / x) / 2.0
    >>> x
    1.4142156862745097


Квадратное уравнение
====================


    >>> import math

    >>> def quadratic(a, b, c):
    ...     D = (b * b) - (4 * a * c)
    ...     d = math.sqrt(D)
    ...     x1 = (-b - d) / 2 * a
    ...     x2 = ( b - d) / 2 * a
    ...     return x1, x2


    >>> x1, x2 = quadratic(1, 2, 1)
    >>> x1
    -1.0
    >>> x2
    1.0


"""
